In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("Employment Survey Data.csv")

In [7]:
df.head()

,ID,Name,Age,Gender,City,Education,Employment Status,Salary,Health Condition,Credit Score
0,1,GARCIA JUAN,78,M,Albuquerque,Bachelor,Employed,"$80,000",Good,720
1,2,MONTOYA CAMERON,17,F,Albuque,Associate,Unemployed,$0,Excellent,NaN
2,3,SATTERFIELD VIVIANA,15,M,Albuque,PhD,Self-employed,"$120,000",Poor,550
3,4,MENDIOLA CARLOS,32,F,Albuque,High School,Employed,"$45,000",Excellent,800
4,5,MULA VIVIAN,72,M,Albuque,Master's,Retired,"$50,000",Average,680

In [11]:
# to identify the number of missing entries

df.isna().sum()

ID                      0
Name                    0
Age                     0
Gender               1626
City                    0
Education             216
Employment Status       0
Salary                  0
Health Condition       45
Credit Score          504
dtype: int64

In [16]:
df["Salary"].tail(50)

1606           $150,000 (Outlier)
1607                          $0
1608           $80,000 (Unstable)
1609            $20,000 (Stipend)
1610             $30,000 (Hourly)
1611                          $0
1612           $45,000 (Unstable)
1613                     $60,000
1614                          $0
1615          $120,000 (Seasonal)
1616                          $0
1617        $130,000 (Commission)
1618                          $0
1619                     $90,000
1620                          $0
1621             $25,000 (Hourly)
1622           $70,000 (Seasonal)
1623            $40,000 (Pension)
1624           $42,000 (Unstable)
1625                     $55,000
1626         $18,000 (Summer Job)
1627                    $140,000
1628                          $0
1629                    $100,000
1630                          $0
1631           $30,000 (Unstable)
1632                     $85,000
1633    $50,000 (Social Security)
1634                          $0
1635                     $40,000
1636                          $0
1637                          $0
1638                          $0
1639        $110,000 (Commission)
1640                          $0
1641           $38,000 (Unstable)
1642                     $95,000
1643    $55,000 (Social Security)
1644           $150,000 (Outlier)
1645                          $0
1646           $80,000 (Unstable)
1647            $20,000 (Stipend)
1648             $30,000 (Hourly)
1649                          $0
1650           $45,000 (Unstable)
1651                     $60,000
1652                          $0
1653          $120,000 (Seasonal)
1654                          $0
1655        $130,000 (Commission)
Name: Salary, dtype: object